konf/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРаботПланируемое</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРаботПланируемое</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасовПотраченоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

konf/src/Documents/ВКМ_ОбслуживаниеКлиента/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область СлужебныеПроцедурыИФункции
	
	Процедура СоздатьИлиИзменитьЭлементСпрВКМ_УведомленияТелеграмБоту(НовыйЗаказ, Дата, ДатаПрроведенияРабот, Специалист, ВремяНачалаРаботПланируемое , ВремяОкончанияРаботПланируемое, Номер, МассивИзменений) Экспорт;
		
		
		НомерДокумента = ПрефиксацияОбъектовКлиентСервер.УдалитьЛидирующиеНулиИзНомераОбъекта(Номер); 
		ДатаДокумента = Формат(Дата, "ДЛФ=D");
		ДатаПроведенияРаботТекст = Формат(ДатаПрроведенияРабот,"ДЛФ=DD" );
		ВремяНачалаРабот = Лев(Формат(ВремяНачалаРаботПланируемое, "ДЛФ=T"),СтрДлина(Формат(ВремяНачалаРаботПланируемое, "ДЛФ=T"))- 3);
		ВремяОкончанияРабот = Лев(Формат(ВремяОкончанияРаботПланируемое, "ДЛФ=T"),СтрДлина(Формат(ВремяОкончанияРаботПланируемое, "ДЛФ=T")) - 3);
		
		
		НачалоСообщения = "";
		
		ТекстСообщения =  СтрШаблон("№ %1 от %2 %3 %3 Специалист: %4 &&Изменено_Специалист&&. %3 Планируемый период проведения работ: %3 Дата: %5 &&Изменено_ДатаПроведения&& %3 Время проведения: с %6 по %7 &&Изменено_ВремяПроведения&&", НомерДокумента, ДатаДокумента, Символы.ПС, Специалист, ДатаПроведенияРаботТекст, ВремяНачалаРабот, ВремяОкончанияРабот);
		
		Если НовыйЗаказ Тогда 
			НачалоСообщения = ("Создан заказ ""Обслуживание клиента""");
			
			ТекстСообщения = СтрШаблон("%1 %2",НачалоСообщения, ТекстСообщения);
			
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "&&Изменено_Специалист&&", "");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "&&Изменено_ДатаПроведения&&", "");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "&&Изменено_ВремяПроведения&&", "");
		Иначе
			НачалоСообщения = ("Обновлен заказ ""Обслуживание клиента"" "); 
			
			ТекстСообщения = СтрШаблон("%1 %2",НачалоСообщения, ТекстСообщения);
			
			Для Каждого Изменение из МассивИзменений Цикл
				
				Если Изменение = "Специалист" Тогда
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "&&Изменено_Специалист&&", "(специалист изменён)");	
				ИначеЕсли Изменение = "ДатаПроведения" Тогда
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "&&Изменено_ДатаПроведения&&", "(дата проведения перенесена)")	
				ИначеЕсли Изменение = "ВремяПроведения" Тогда  
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "&&Изменено_ВремяПроведения&&", "(время проведения работ изменено)")	
				КонецЕсли;
				
			КонецЦикла;   
			
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "&&Изменено_Специалист&&", "");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "&&Изменено_ДатаПроведения&&", "");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "&&Изменено_ВремяПроведения&&", "");
			
		КонецЕсли;
				
		СпрОбъект = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
		
		СпрОбъект.Наименование = Неопределено;
		СпрОбъект.Код = Неопределено;
		СпрОбъект.ТекстСообщения = ТекстСообщения; 
		Попытка
			СпрОбъект.Записать(); 
			
			
			ВКМ_Телеграм.ОтправитьСообщениеВТелеграмКанал(ТекстСообщения);
		Исключение
			ЗаписьЖурналаРегистрации("Создание элемента спр.ВКМ_УведомленияТелеграмБоту",УровеньЖурналаРегистрации.Ошибка,Справочники.ВКМ_УведомленияТелеграмБоту,,"Не удалось создать элемент",);
		КонецПопытки;      
		
	КонецПроцедуры
	
	#КонецОбласти
	
#КонецЕсли
